#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
random_string.suffix: Refreshing state... [id=lllm1h]
azurerm_resource_group.main_resource_group: Refreshing state... [id=/subscriptions/ec18dca1-0751-4307-bbac-6150896ac498/resourceGroups/terraformprod_lllm1h]
data.azurerm_client_config.current: Reading...
data.azurerm_client_config.current: Read complete after 0s [id=2022-10-06 19:15:33.542722913 +0000 UTC]
data.azuread_service_principal.az_sp_pl: Reading...
azurerm_windows_function_app.dicomIngest: Refreshing state... [id=/subscriptions/ec18dca1-0751-4307-bbac-6150896ac498/resourceGroups/terraformprod_lllm1h/providers/Microsoft.Web/sites/terraformprod-function-lllm1h]
azurerm_service_plan.servicePlan: Refreshing state... [id=/subscriptions/ec18dca1-0751-4307-bbac-6150896ac498/resourceGroups/terraformprod_lllm1h/providers/Microsoft.Web/serverfarms/terraformprod-plan-lllm1h]
azurerm_storage_account.storage_account: Refreshing state... [id=/subscriptions/ec18dca1-0751-4307-bbac-6150896ac498/resourceGroups/terraformprod_lllm1h/providers/Microsoft.Storage/storageAccounts/terraformprodstorlllm1h]
data.azuread_service_principal.az_sp_pl: Read complete after 0s [id=ee6d6371-5def-4736-85b1-c4ebf5467acd]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # azurerm_windows_function_app.azureFunction will be created
  + resource "azurerm_windows_function_app" "azureFunction" {
      + app_settings                      = {
          + "STORAGE_CONNECTION_STRING" = (sensitive)
        }
      + builtin_logging_enabled           = true
      + client_certificate_enabled        = false
      + client_certificate_mode           = "Optional"
      + content_share_force_disabled      = false
      + custom_domain_verification_id     = (sensitive value)
      + daily_memory_time_quota           = 0
      + default_hostname                  = (known after apply)
      + enabled                           = true
      + functions_extension_version       = "~4"
      + https_only                        = (known after apply)
      + id                                = (known after apply)
      + key_vault_reference_identity_id   = (known after apply)
      + kind                              = (known after apply)
      + location                          = "eastus"
      + name                              = "terraformprod-function-lllm1h"
      + outbound_ip_address_list          = (known after apply)
      + outbound_ip_addresses             = (known after apply)
      + possible_outbound_ip_address_list = (known after apply)
      + possible_outbound_ip_addresses    = (known after apply)
      + resource_group_name               = "terraformprod_lllm1h"
      + service_plan_id                   = "/subscriptions/ec18dca1-0751-4307-bbac-6150896ac498/resourceGroups/terraformprod_lllm1h/providers/Microsoft.Web/serverfarms/terraformprod-plan-lllm1h"
      + site_credential                   = (known after apply)
      + storage_account_access_key        = (sensitive value)
      + storage_account_name              = "terraformprodstorlllm1h"
      + storage_uses_managed_identity     = false

      + auth_settings {
          + additional_login_parameters    = (known after apply)
          + allowed_external_redirect_urls = (known after apply)
          + default_provider               = (known after apply)
          + enabled                        = (known after apply)
          + issuer                         = (known after apply)
          + runtime_version                = (known after apply)
          + token_refresh_extension_hours  = (known after apply)
          + token_store_enabled            = (known after apply)
          + unauthenticated_client_action  = (known after apply)

          + active_directory {
              + allowed_audiences          = (known after apply)
              + client_id                  = (known after apply)
              + client_secret              = (sensitive value)
              + client_secret_setting_name = (known after apply)
            }

          + facebook {
              + app_id                  = (known after apply)
              + app_secret              = (sensitive value)
              + app_secret_setting_name = (known after apply)
              + oauth_scopes            = (known after apply)
            }

          + github {
              + client_id                  = (known after apply)
              + client_secret              = (sensitive value)
              + client_secret_setting_name = (known after apply)
              + oauth_scopes               = (known after apply)
            }

          + google {
              + client_id                  = (known after apply)
              + client_secret              = (sensitive value)
              + client_secret_setting_name = (known after apply)
              + oauth_scopes               = (known after apply)
            }

          + microsoft {
              + client_id                  = (known after apply)
              + client_secret              = (sensitive value)
              + client_secret_setting_name = (known after apply)
              + oauth_scopes               = (known after apply)
            }

          + twitter {
              + consumer_key                 = (known after apply)
              + consumer_secret              = (sensitive value)
              + consumer_secret_setting_name = (known after apply)
            }
        }

      + site_config {
          + always_on                         = (known after apply)
          + app_scale_limit                   = (known after apply)
          + default_documents                 = (known after apply)
          + detailed_error_logging_enabled    = (known after apply)
          + elastic_instance_minimum          = (known after apply)
          + ftps_state                        = "Disabled"
          + health_check_eviction_time_in_min = (known after apply)
          + http2_enabled                     = false
          + ip_restriction                    = (known after apply)
          + load_balancing_mode               = "LeastRequests"
          + managed_pipeline_mode             = "Integrated"
          + minimum_tls_version               = "1.2"
          + pre_warmed_instance_count         = (known after apply)
          + remote_debugging_enabled          = false
          + remote_debugging_version          = (known after apply)
          + scm_ip_restriction                = (known after apply)
          + scm_minimum_tls_version           = "1.2"
          + scm_type                          = (known after apply)
          + scm_use_main_ip_restriction       = false
          + use_32_bit_worker                 = true
          + vnet_route_all_enabled            = false
          + websockets_enabled                = false
          + windows_fx_version                = (known after apply)
          + worker_count                      = (known after apply)
        }
    }

  # azurerm_windows_function_app.dicomIngest will be destroyed
  # (because azurerm_windows_function_app.dicomIngest is not in configuration)
  - resource "azurerm_windows_function_app" "dicomIngest" {
      - app_settings                      = {
          - "STORAGE_CONNECTION_STRING" = (sensitive)
        } -> null
      - builtin_logging_enabled           = true -> null
      - client_certificate_enabled        = false -> null
      - client_certificate_mode           = "Optional" -> null
      - content_share_force_disabled      = false -> null
      - custom_domain_verification_id     = (sensitive value)
      - daily_memory_time_quota           = 0 -> null
      - default_hostname                  = "terraformprod-function-lllm1h.azurewebsites.net" -> null
      - enabled                           = true -> null
      - functions_extension_version       = "~4" -> null
      - https_only                        = true -> null
      - id                                = "/subscriptions/ec18dca1-0751-4307-bbac-6150896ac498/resourceGroups/terraformprod_lllm1h/providers/Microsoft.Web/sites/terraformprod-function-lllm1h" -> null
      - key_vault_reference_identity_id   = "SystemAssigned" -> null
      - kind                              = "functionapp" -> null
      - location                          = "eastus" -> null
      - name                              = "terraformprod-function-lllm1h" -> null
      - outbound_ip_address_list          = [
          - "20.42.27.62",
          - "20.42.28.27",
          - "20.42.28.138",
          - "20.42.30.112",
          - "20.42.30.193",
          - "52.188.216.12",
          - "20.42.26.252",
        ] -> null
      - outbound_ip_addresses             = "20.42.27.62,20.42.28.27,20.42.28.138,20.42.30.112,20.42.30.193,52.188.216.12,20.42.26.252" -> null
      - possible_outbound_ip_address_list = [
          - "20.42.27.62",
          - "20.42.28.27",
          - "20.42.28.138",
          - "20.42.30.112",
          - "20.42.30.193",
          - "52.188.216.12",
          - "40.76.174.189",
          - "40.76.174.246",
          - "40.76.175.14",
          - "40.76.175.91",
          - "40.76.175.191",
          - "20.62.144.10",
          - "52.188.216.142",
          - "52.188.216.249",
          - "52.188.217.23",
          - "40.88.245.122",
          - "40.88.244.254",
          - "20.72.131.171",
          - "20.42.26.252",
        ] -> null
      - possible_outbound_ip_addresses    = "20.42.27.62,20.42.28.27,20.42.28.138,20.42.30.112,20.42.30.193,52.188.216.12,40.76.174.189,40.76.174.246,40.76.175.14,40.76.175.91,40.76.175.191,20.62.144.10,52.188.216.142,52.188.216.249,52.188.217.23,40.88.245.122,40.88.244.254,20.72.131.171,20.42.26.252" -> null
      - resource_group_name               = "terraformprod_lllm1h" -> null
      - service_plan_id                   = "/subscriptions/ec18dca1-0751-4307-bbac-6150896ac498/resourceGroups/terraformprod_lllm1h/providers/Microsoft.Web/serverfarms/terraformprod-plan-lllm1h" -> null
      - site_credential                   = [
          - {
              - name     = "$terraformprod-function-lllm1h"
              - password = "gPl2TmCWh2khpsJffCFWGwWjYyWudThQJkjhYyPvANjCvuiArHbCJdX8vJpY"
            },
        ] -> null
      - storage_account_access_key        = (sensitive value)
      - storage_account_name              = "terraformprodstorlllm1h" -> null
      - storage_key_vault_secret_id       = "" -> null
      - storage_uses_managed_identity     = false -> null
      - tags                              = {} -> null
      - virtual_network_subnet_id         = "" -> null

      - auth_settings {
          - additional_login_parameters    = {} -> null
          - allowed_external_redirect_urls = [] -> null
          - enabled                        = false -> null
          - token_refresh_extension_hours  = 0 -> null
          - token_store_enabled            = false -> null
        }

      - site_config {
          - always_on                         = false -> null
          - app_scale_limit                   = 200 -> null
          - default_documents                 = [
              - "Default.htm",
              - "Default.html",
              - "Default.asp",
              - "index.htm",
              - "index.html",
              - "iisstart.htm",
              - "default.aspx",
              - "index.php",
            ] -> null
          - detailed_error_logging_enabled    = false -> null
          - elastic_instance_minimum          = 0 -> null
          - ftps_state                        = "Disabled" -> null
          - health_check_eviction_time_in_min = 0 -> null
          - http2_enabled                     = false -> null
          - ip_restriction                    = [] -> null
          - load_balancing_mode               = "LeastRequests" -> null
          - managed_pipeline_mode             = "Integrated" -> null
          - minimum_tls_version               = "1.2" -> null
          - pre_warmed_instance_count         = 0 -> null
          - remote_debugging_enabled          = false -> null
          - runtime_scale_monitoring_enabled  = false -> null
          - scm_ip_restriction                = [] -> null
          - scm_minimum_tls_version           = "1.2" -> null
          - scm_type                          = "None" -> null
          - scm_use_main_ip_restriction       = false -> null
          - use_32_bit_worker                 = true -> null
          - vnet_route_all_enabled            = false -> null
          - websockets_enabled                = false -> null
          - worker_count                      = 1 -> null
        }
    }

Plan: 1 to add, 0 to change, 1 to destroy.

Changes to Outputs:
  + function_name = "terraformprod-function-lllm1h"
  + rg_name       = "terraformprod_lllm1h"
  + storage_name  = "terraformprodstorlllm1h"

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @mhassaninmsft, Action: `pull_request`*